; ============================================================
; PoP_UniversalPatch 配置文件
; 该文件以 UTF-16 编码创建，因此非 ASCII 路径和注释均安全可用。
; ASI 模块：PoP4_UniversalPatch.asi
; 生成的名称遵循 ASI 文件名：
;           PoP4_UniversalPatch.ini
;           PoP4_UniversalPatch.log
;           PoP4_UniversalPatch_CompatibilityReport.txt
; 该插件从不修改游戏 EXE 文件；所有补丁仅在运行时生效。
; GOG 版、Steam 解压版以及原始打包的 SteamStub EXE 文件均会被自动检测。
; ============================================================

; -------------------- 语言 --------------------
[Language]
; 文本/界面/字幕语言。
; 当游戏查询原始注册表键LNG_Language时，ASI返回此值。
; 0=无/自动
; 1=英语，2=法语，3=西班牙语，4=波兰语，5=德语，
; 6=中文，7=匈牙利语，8=意大利语，9=日语，10=捷克语，
; 11=朝鲜语，12=俄语，13=荷兰语。
TextLanguage=6

; 请求的对话语音语言，使用相同的ID表。
; 必须存在一个匹配的DataPC_StreamedSoundsXXX.forge文件。
VoiceLanguage=1

; -------------------- 声音 --------------------
[Voice]
; 1 = 启用独立的文本和语音语言。
; 0 = 保持游戏语音逻辑不变。
Enable=1

; 保持两个选项均为1。
; 随后，包、资源、捆绑包和名称会作为一个事务应用
; 从而防止不安全的半补丁语言状态。
AssetPatch=1
RequireAssetPatch=1

; 自动回退功能会在修补前检查请求的语音锻造是否存在。
; 如果缺失，将安全地使用备用语言。
; 如果两者均缺失，则会禁用语音补丁，而不是强制选择损坏的软件包。
AutoFallback=1
FallbackLanguage=1

; -------------------- 显示 --------------------
[Display]
; 0=全屏, 1=窗口化, 2=无边框窗口（默认）。
WindowMode=2
; 仅影响无边框窗口： 0=保持游戏位置，1=将窗口居中。
BorderlessCenter=0
Width=1920
Height=1080
; 0=关，1=开。
VSync=1
Widescreen=1
; 0=自动计算宽高比；公式：floor((宽度/高度)*100)；
; 非0则使用手动值，例如177。
AspectRatio=0

; -------------------- DPI --------------------
[DPI]
DPIAware=1
; 1=系统DPI（推荐），2=每显示器，3=每显示器V2。
DPIAwareness=1

; -------------------- 性能 --------------------
[Performance]
; 将此旧游戏限制在较小的逻辑CPU集上，以防止游戏崩溃。
LimitCpuCores=1
; 自动限制在1到10之间；默认值为4。
MaxCpuCores=4

; -------------------- 输入 --------------------
[Input]
; 这些选项仅适用于窗口模式1或2
; 全屏模式不受影响。
; 清除DirectInput的DISCL_NOWINKEY标志，使得Windows键仍然可用。
AllowWinKeyInWindowed=1
; 在游戏失去焦点时释放鼠标剪裁。
; 它不会在游戏聚焦时永久禁用正常的鼠标捕获。
ReleaseMouseOnFocusLoss=1

; -------------------- 图形 --------------------
[Graphics]
; 0=低，1=中，2=高。
Quality=2
; 有效值：0=关闭，2=x2，4=x4，8=x8。
; 无效值将被修正。
AntiAliasing=4
; 1=高分辨率纹理，0=降质/低纹理。
HighResolutionTextures=1

[AdvancedGraphics]
; 额外的引擎注册表值；
; 除非测试，否则保持默认值。
ShadowQuality=2
PostEffects=2

; -------------------- 调试 / 诊断 --------------------
[Debug]
; LogLevel 合并了旧的日志开关和跟踪控制：
;   0 = 完全禁用日志文件
;   1 = 仅警告/错误和配置修正
;   2 = 正常启动/补丁信息（推荐）
;   3 = 详细输出，包括 DataPC/forge 文件打开跟踪
LogLevel=0
; 使用EXE、钩子、语音包和设置写入名为ASI的兼容性报告。
CompatibilityReport=0
; 已打包的 Steam 运行时补丁控制。普通用户应保持默认设置。
PackedSteamPatchTries=10000
PackedSteamPatchIntervalMs=1
PackedSteamPatchStatusEvery=1000
